# Tips and Trick Python Pandas 15 !

# Memecah Nilai String Suatu Kolom ke dalam beberapa Kolom Baru

# Import Module

In [2]:
import pandas as pd

print(pd.__version__)

1.2.4

# Buat Data Frame

In [3]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
       'tempat_kelahiran':['Surakarta, Jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}

df = pd.DataFrame(data)

df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

# Memecah Nama Depan dan Nama Belakang

- Bentuk kolom terlebih dahulu -> `nama depan` dan `nama belakang`
- String splitting dengan `str.split`
- `expand=True` , mengijinkan membuat kolom baru

In [6]:
df[['nama depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)

df

           nama        tempat_kelahiran nama depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

# Memecah Kota dan Provinsi Kelahiran

In [7]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)

df

,nama,tempat_kelahiran,nama depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur